"""
Тут я бы написал unit-тест, проверяющий сложную работу логики метода input_data_loaders.JSONDataLoader._parse

Поскольку мне видится это место в коде способным принести неявные ошибки, требующие долгого разбирательства. Но
поскольку в этом месте я и не написал той сложной логики, которая бы разбиралась с переплетением JSON'ов, то и тест не
написать.
"""

"""
А тут хорошо смотрелись бы тесты, которые бы сравнивали побайтово итоговый результат работы программы с эталонными
изображениями. Правда, это уже не слишком похоже на unit-тестирование, но вот как интеграционные- неплохи.
"""
